neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define T0MCR_MR1INT               0x08   /* Bit 3: MR1INT (Interrupt on MR1) */
#define T0MCR_MR1INT_DISABLED      0x00   /* Disabled */
#define T0MCR_MR1INT_ENABLED       0x01   /* Enabled */

#define T0MCR_MR0STOP              0x04   /* Bit 2: MR0STOP (Stop on MR0) */
#define T0MCR_MR0STOP_DISABLED     0x00   /* Disabled */
#define T0MCR_MR0STOP_ENABLED      0x01   /* Enabled */

#define T0MCR_MR0RES               0x02   /* Bit 1: MR0RES (Reset on MR0) */
#define T0MCR_MR0RES_DISABLED      0x00   /* Disabled */
#define T0MCR_MR0RES_ENABLED       0x01   /* Enabled */

#define T0MCR_MR0INT               0x01   /* Bit 0: MR0INT (Interrupt on MR0) */
#define T0MCR_MR0INT_DISABLED      0x00   /* Disabled */
#define T0MCR_MR0INT_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 0 Match Register 0
**---------------------------------------------------------------------------
*/

#define T0MR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Match Register 1
**---------------------------------------------------------------------------
*/

#define T0MR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Match Register 2
**---------------------------------------------------------------------------
*/

#define T0MR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Match Register 3
**---------------------------------------------------------------------------
*/

#define T0MR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Control Register
**---------------------------------------------------------------------------
*/

#define T0CCR_CAP2INT              0x100  /* Bit 8: CAP2INT (Interrupt on capture CAP2) */
#define T0CCR_CAP2INT_DISABLED     0x00   /* Disabled */
#define T0CCR_CAP2INT_ENABLED      0x01   /* Enabled */

#define T0CCR_CAP2FE               0x80   /* Bit 7: CAP2FE (Capture on CAP2 falling edge) */
#define T0CCR_CAP2FE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP2FE_ENABLED       0x01   /* Enabled */

#define T0CCR_CAP2RE               0x40   /* Bit 6: CAP2RE (Capture on CAP2 rising edge) */
#define T0CCR_CAP2RE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP2RE_ENABLED       0x01   /* Enabled */

#define T0CCR_CAP1INT              0x20   /* Bit 5: CAP1INT (Interrupt on capture CAP1) */
#define T0CCR_CAP1INT_DISABLED     0x00   /* Disabled */
#define T0CCR_CAP1INT_ENABLED      0x01   /* Enabled */

#define T0CCR_CAP1FE               0x10   /* Bit 4: CAP1FE (Capture on CAP1 falling edge) */
#define T0CCR_CAP1FE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP1FE_ENABLED       0x01   /* Enabled */

#define T0CCR_CAP1RE               0x08   /* Bit 3: CAP1RE (Capture on CAP1 rising edge) */
#define T0CCR_CAP1RE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP1RE_ENABLED       0x01   /* Enabled */

#define T0CCR_CAP0INT              0x04   /* Bit 2: CAP0INT (Interrupt on capture CAP0) */
#define T0CCR_CAP0INT_DISABLED     0x00   /* Disabled */
#define T0CCR_CAP0INT_ENABLED      0x01   /* Enabled */

#define T0CCR_CAP0FE               0x02   /* Bit 1: CAP0FE (Capture on CAP0 falling edge) */
#define T0CCR_CAP0FE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP0FE_ENABLED       0x01   /* Enabled */

#define T0CCR_CAP0RE               0x01   /* Bit 0: CAP0RE (Capture on CAP0 rising edge) */
#define T0CCR_CAP0RE_DISABLED      0x00   /* Disabled */
#define T0CCR_CAP0RE_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 0
**---------------------------------------------------------------------------
*/

#define T0CR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 1
**---------------------------------------------------------------------------
*/

#define T0CR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 2
**---------------------------------------------------------------------------
*/

#define T0CR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 Capture Register 3
**---------------------------------------------------------------------------
*/

#define T0CR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 0 External Match Register
**---------------------------------------------------------------------------
*/

#define T0EMR_EMC2                 0x300  /* Bit 9-8: EMC2 (External match control 2) */
#define T0EMR_EMC2_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC2_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC2_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC2_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EMC1                 0xc0   /* Bit 7-6: EMC1 (External match control 1) */
#define T0EMR_EMC1_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC1_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC1_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC1_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EMC0                 0x30   /* Bit 5-4: EMC0 (External match control 0) */
#define T0EMR_EMC0_NOTHING         0x00   /* Do nothing */
#define T0EMR_EMC0_CLEAR           0x01   /* Clear output to 0 */
#define T0EMR_EMC0_SET             0x02   /* Set output to 1 */
#define T0EMR_EMC0_TOGGLE          0x03   /* Toggle output */

#define T0EMR_EM2                  0x04   /* Bit 2: EM2 (External match 2) */
#define T0EMR_EM2_LOW              0x00   /* Low */
#define T0EMR_EM2_HIGH             0x01   /* High */

#define T0EMR_EM1                  0x02   /* Bit 1: EM1 (External match 1) */
#define T0EMR_EM1_LOW              0x00   /* Low */
#define T0EMR_EM1_HIGH             0x01   /* High */

