neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define T0EMR_EM0                  0x01   /* Bit 0: EM0 (External match 0) */
#define T0EMR_EM0_LOW              0x00   /* Low */
#define T0EMR_EM0_HIGH             0x01   /* High */


/*
**---------------------------------------------------------------------------
**  Timer 1 Interrupt Register
**---------------------------------------------------------------------------
*/

#define T1IR_CR3INT                0x80   /* Bit 7: CR3INT (Interrupt flag for capture channel 3) */
#define T1IR_CR3INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR3INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR2INT                0x40   /* Bit 6: CR2INT (Interrupt flag for capture channel 2) */
#define T1IR_CR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR2INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR1INT                0x20   /* Bit 5: CR1INT (Interrupt flag for capture channel 1) */
#define T1IR_CR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR1INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_CR0INT                0x10   /* Bit 4: CR0INT (Interrupt flag for capture channel 0) */
#define T1IR_CR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_CR0INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR3INT                0x08   /* Bit 3: MR3INT (Interrupt flag for match channel 3) */
#define T1IR_MR3INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR3INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR2INT                0x04   /* Bit 2: MR2INT (Interrupt flag for match channel 2) */
#define T1IR_MR2INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR2INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR1INT                0x02   /* Bit 1: MR1INT (Interrupt flag for match channel 1) */
#define T1IR_MR1INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR1INT_INTERRUPT      0x01   /* Interrupt */

#define T1IR_MR0INT                0x01   /* Bit 0: MR0INT (Interrupt flag for match channel 0) */
#define T1IR_MR0INT_NO_INTERRUPT   0x00   /* No interrupt */
#define T1IR_MR0INT_INTERRUPT      0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  Timer 1 Timer Control Register
**---------------------------------------------------------------------------
*/

#define T1TCR_CR                   0x02   /* Bit 1: CR (Counter reset) */
#define T1TCR_CR_NO_RESET          0x00   /* No reset */
#define T1TCR_CR_RESET             0x01   /* Generate reset */

#define T1TCR_CE                   0x01   /* Bit 0: CE (Counter enable) */
#define T1TCR_CE_DISABLED          0x00   /* Disabled */
#define T1TCR_CE_ENABLED           0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 1 Timer Counter
**---------------------------------------------------------------------------
*/

#define T1TC_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer counter value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Prescale Register
**---------------------------------------------------------------------------
*/

#define T1PR_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer prescaler max value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Prescale Counter
**---------------------------------------------------------------------------
*/

#define T1PC_VALUE                 0xffffffff /* Bit 31-0: VALUE (Timer prescale counter value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Control Register
**---------------------------------------------------------------------------
*/

#define T1MCR_MR3STOP              0x800  /* Bit 11: MR3STOP (Stop on MR3) */
#define T1MCR_MR3STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR3STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR3RES               0x400  /* Bit 10: MR3RES (Reset on MR3) */
#define T1MCR_MR3RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR3RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR3INT               0x200  /* Bit 9: MR3INT (Interrupt on MR3) */
#define T1MCR_MR3INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR3INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR2STOP              0x100  /* Bit 8: MR2STOP (Stop on MR2) */
#define T1MCR_MR2STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR2STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR2RES               0x80   /* Bit 7: MR2RES (Reset on MR2) */
#define T1MCR_MR2RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR2RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR2INT               0x40   /* Bit 6: MR2INT (Interrupt on MR2) */
#define T1MCR_MR2INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR2INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR1STOP              0x20   /* Bit 5: MR1STOP (Stop on MR1) */
#define T1MCR_MR1STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR1STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR1RES               0x10   /* Bit 4: MR1RES (Reset on MR1) */
#define T1MCR_MR1RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR1RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR1INT               0x08   /* Bit 3: MR1INT (Interrupt on MR1) */
#define T1MCR_MR1INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR1INT_ENABLED       0x01   /* Enabled */

#define T1MCR_MR0STOP              0x04   /* Bit 2: MR0STOP (Stop on MR0) */
#define T1MCR_MR0STOP_DISABLED     0x00   /* Disabled */
#define T1MCR_MR0STOP_ENABLED      0x01   /* Enabled */

#define T1MCR_MR0RES               0x02   /* Bit 1: MR0RES (Reset on MR0) */
#define T1MCR_MR0RES_DISABLED      0x00   /* Disabled */
#define T1MCR_MR0RES_ENABLED       0x01   /* Enabled */

#define T1MCR_MR0INT               0x01   /* Bit 0: MR0INT (Interrupt on MR0) */
#define T1MCR_MR0INT_DISABLED      0x00   /* Disabled */
#define T1MCR_MR0INT_ENABLED       0x01   /* Enabled */


