neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 0
**---------------------------------------------------------------------------
*/

#define T1MR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 1
**---------------------------------------------------------------------------
*/

#define T1MR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 2
**---------------------------------------------------------------------------
*/

#define T1MR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Match Register 3
**---------------------------------------------------------------------------
*/

#define T1MR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer match value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Control Register
**---------------------------------------------------------------------------
*/

#define T1CCR_CAP3INT              0x800  /* Bit 11: CAP3INT (Interrupt on capture CAP3) */
#define T1CCR_CAP3INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP3INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP3FE               0x400  /* Bit 10: CAP3FE (Capture on CAP3 falling edge) */
#define T1CCR_CAP3FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP3FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP3RE               0x200  /* Bit 9: CAP3RE (Capture on CAP3 rising edge) */
#define T1CCR_CAP3RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP3RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP2INT              0x100  /* Bit 8: CAP2INT (Interrupt on capture CAP2) */
#define T1CCR_CAP2INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP2INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP2FE               0x80   /* Bit 7: CAP2FE (Capture on CAP2 falling edge) */
#define T1CCR_CAP2FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP2FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP2RE               0x40   /* Bit 6: CAP2RE (Capture on CAP2 rising edge) */
#define T1CCR_CAP2RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP2RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP1INT              0x20   /* Bit 5: CAP1INT (Interrupt on capture CAP1) */
#define T1CCR_CAP1INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP1INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP1FE               0x10   /* Bit 4: CAP1FE (Capture on CAP1 falling edge) */
#define T1CCR_CAP1FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP1FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP1RE               0x08   /* Bit 3: CAP1RE (Capture on CAP1 rising edge) */
#define T1CCR_CAP1RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP1RE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP0INT              0x04   /* Bit 2: CAP0INT (Interrupt on capture CAP0) */
#define T1CCR_CAP0INT_DISABLED     0x00   /* Disabled */
#define T1CCR_CAP0INT_ENABLED      0x01   /* Enabled */

#define T1CCR_CAP0FE               0x02   /* Bit 1: CAP0FE (Capture on CAP0 falling edge) */
#define T1CCR_CAP0FE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP0FE_ENABLED       0x01   /* Enabled */

#define T1CCR_CAP0RE               0x01   /* Bit 0: CAP0RE (Capture on CAP0 rising edge) */
#define T1CCR_CAP0RE_DISABLED      0x00   /* Disabled */
#define T1CCR_CAP0RE_ENABLED       0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Register 0
**---------------------------------------------------------------------------
*/

#define T1CR0_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Register 1
**---------------------------------------------------------------------------
*/

#define T1CR1_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Register 2
**---------------------------------------------------------------------------
*/

#define T1CR2_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 Capture Register 3
**---------------------------------------------------------------------------
*/

#define T1CR3_VALUE                0xffffffff /* Bit 31-0: VALUE (Timer capture value) */


/*
**---------------------------------------------------------------------------
**  Timer 1 External Match Register
**---------------------------------------------------------------------------
*/

#define T1EMR_EMC3                 0xc00  /* Bit 11-10: EMC3 (External match control 3) */
#define T1EMR_EMC3_NOTHING         0x00   /* Do nothing */
#define T1EMR_EMC3_CLEAR           0x01   /* Clear output to 0 */
#define T1EMR_EMC3_SET             0x02   /* Set output to 1 */
#define T1EMR_EMC3_TOGGLE          0x03   /* Toggle output */

#define T1EMR_EMC2                 0x300  /* Bit 9-8: EMC2 (External match control 2) */
#define T1EMR_EMC2_NOTHING         0x00   /* Do nothing */
#define T1EMR_EMC2_CLEAR           0x01   /* Clear output to 0 */
#define T1EMR_EMC2_SET             0x02   /* Set output to 1 */
#define T1EMR_EMC2_TOGGLE          0x03   /* Toggle output */

#define T1EMR_EMC1                 0xc0   /* Bit 7-6: EMC1 (External match control 1) */
#define T1EMR_EMC1_NOTHING         0x00   /* Do nothing */
#define T1EMR_EMC1_CLEAR           0x01   /* Clear output to 0 */
#define T1EMR_EMC1_SET             0x02   /* Set output to 1 */
#define T1EMR_EMC1_TOGGLE          0x03   /* Toggle output */

#define T1EMR_EMC0                 0x30   /* Bit 5-4: EMC0 (External match control 0) */
#define T1EMR_EMC0_NOTHING         0x00   /* Do nothing */
#define T1EMR_EMC0_CLEAR           0x01   /* Clear output to 0 */
#define T1EMR_EMC0_SET             0x02   /* Set output to 1 */
#define T1EMR_EMC0_TOGGLE          0x03   /* Toggle output */

#define T1EMR_EM3                  0x08   /* Bit 3: EM3 (External match 3) */
#define T1EMR_EM3_LOW              0x00   /* Low */
#define T1EMR_EM3_HIGH             0x01   /* High */

#define T1EMR_EM2                  0x04   /* Bit 2: EM2 (External match 2) */
#define T1EMR_EM2_LOW              0x00   /* Low */
#define T1EMR_EM2_HIGH             0x01   /* High */

#define T1EMR_EM1                  0x02   /* Bit 1: EM1 (External match 1) */
#define T1EMR_EM1_LOW              0x00   /* Low */
#define T1EMR_EM1_HIGH             0x01   /* High */

#define T1EMR_EM0                  0x01   /* Bit 0: EM0 (External match 0) */
#define T1EMR_EM0_LOW              0x00   /* Low */
#define T1EMR_EM0_HIGH             0x01   /* High */


