neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define U0LCR_WLS                  0x03   /* Bit 1-0: WLS (Word length select) */
#define U0LCR_WLS_D5               0x00   /* 5 data bits */
#define U0LCR_WLS_D6               0x01   /* 6 data bits */
#define U0LCR_WLS_D7               0x02   /* 7 data bits */
#define U0LCR_WLS_D8               0x03   /* 8 data bits */


/*
**---------------------------------------------------------------------------
**  UART0 Line Status Register
**---------------------------------------------------------------------------
*/

#define U0LSR_RXFE                 0x80   /* Bit 7: RXFE (Receive error) */
#define U0LSR_RXFE_OK              0x00   /* No receive error in FIFO mode or Always 0 in non FIFO mode */
#define U0LSR_RXFE_ERROR           0x01   /* Parity, framing or break indication in the FIFO */

#define U0LSR_TEMT                 0x40   /* Bit 6: TEMT (Transmit empty) */
#define U0LSR_TEMT_TRANSMIT        0x00   /* Transmission in progress */
#define U0LSR_TEMT_IDLE            0x01   /* Transmitter idle */

#define U0LSR_THRE                 0x20   /* Bit 5: THRE (Transmit holding register empty) */
#define U0LSR_THRE_VALID           0x00   /* Valid data in transmit register */
#define U0LSR_THRE_EMPTY           0x01   /* Empty */

#define U0LSR_BI                   0x10   /* Bit 4: BI (Break indicator) */
#define U0LSR_BI_NO                0x00   /* No break */
#define U0LSR_BI_BREAK             0x01   /* Break condition detected on receive input line */

#define U0LSR_FE                   0x08   /* Bit 3: FE (Framing error) */
#define U0LSR_FE_OK                0x00   /* No framing error */
#define U0LSR_FE_ERROR             0x01   /* Framing error occured */

#define U0LSR_PE                   0x04   /* Bit 2: PE (Parity error) */
#define U0LSR_PE_OK                0x00   /* No parity error */
#define U0LSR_PE_ERROR             0x01   /* Parity error occured */

#define U0LSR_OE                   0x02   /* Bit 1: OE (Overrun error) */
#define U0LSR_OE_OK                0x00   /* No overrun error */
#define U0LSR_OE_ERROR             0x01   /* Overrun error occured */

#define U0LSR_DR                   0x01   /* Bit 0: DR (Receiver data ready) */
#define U0LSR_DR_EMPTY             0x00   /* Empty */
#define U0LSR_DR_VALID             0x01   /* Valid data in receive buffer register */


/*
**---------------------------------------------------------------------------
**  UART0 Scratch Pad Register
**---------------------------------------------------------------------------
*/

#define U0SCR_DATA                 0xff   /* Bit 7-0: DATA (A readable /writable byte) */


/*
**---------------------------------------------------------------------------
**  UART1 Receiver Buffer Register
**---------------------------------------------------------------------------
*/

#define U1RBR_RXD                  0xff   /* Bit 7-0: RXD (Received data) */


/*
**---------------------------------------------------------------------------
**  UART1 Transmit Holding Register
**---------------------------------------------------------------------------
*/

#define U1THR_TXD                  0xff   /* Bit 7-0: TXD (Transmit data) */


/*
**---------------------------------------------------------------------------
**  UART1 Divisor Latch LSB
**---------------------------------------------------------------------------
*/

#define U1DLL_DIVL                 0xff   /* Bit 7-0: DIVL (Baud rate generator divisor [7:0]) */


/*
**---------------------------------------------------------------------------
**  UART1 Divisor Latch MSB
**---------------------------------------------------------------------------
*/

#define U1DLM_DIVM                 0xff   /* Bit 7-0: DIVM (Baud rate generator divisor [15:8]) */


/*
**---------------------------------------------------------------------------
**  UART1 Interrupt Enable Register
**---------------------------------------------------------------------------
*/

#define U1IER_MSIE                 0x08   /* Bit 3: MSIE (Modem status interrupt enable (MODEM)) */
#define U1IER_MSIE_DISABLED        0x00   /* Disabled */
#define U1IER_MSIE_ENABLED         0x01   /* Enabled */

#define U1IER_RXLSIE               0x04   /* Bit 2: RXLSIE (Rx Line status interrupt enable (RXLINE)) */
#define U1IER_RXLSIE_DISABLED      0x00   /* Disabled */
#define U1IER_RXLSIE_ENABLED       0x01   /* Enabled */

#define U1IER_THREIE               0x02   /* Bit 1: THREIE (Transmit interrupt enable (THRE)) */
#define U1IER_THREIE_DISABLED      0x00   /* Disabled */
#define U1IER_THREIE_ENABLED       0x01   /* Enabled */

#define U1IER_RDAIE                0x01   /* Bit 0: RDAIE (Receive interrupt enable (RDA)) */
#define U1IER_RDAIE_DISABLED       0x00   /* Disabled */
#define U1IER_RDAIE_ENABLED        0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  UART1 Interrupt ID Register
**---------------------------------------------------------------------------
*/

#define U1IIR_IIRFE                0xc0   /* Bit 7-6: IIRFE (FIFO enable) */
#define U1IIR_IIRFE_ONE            0x00   /* 1 (Trigger level 0 (=1)) */
#define U1IIR_IIRFE_FOUR           0x01   /* 4 (Trigger level 1 (=4)) */
#define U1IIR_IIRFE_EIGHT          0x02   /* 8 (Trigger level 2 (=8)) */
#define U1IIR_IIRFE_FOURTEEN       0x03   /* 14 (Trigger level 3 (=14)) */

#define U1IIR_IID                  0x0e   /* Bit 3-1: IID (Interrupt identification) */
#define U1IIR_IID_MODEM_INT        0x00   /* Modem interrupt (Fourth priority) */
#define U1IIR_IID_THRE_INT         0x01   /* Transmit buffer empty interrupt (THRE) (Third priority) */
#define U1IIR_IID_CTI_INT          0x06   /* Character timeout interrupt (CTI) (Second priority) */
#define U1IIR_IID_RDA_INT          0x02   /* Receive data available or Trigger level interrupt code (RDA) (Second priority) */
#define U1IIR_IID_RX_LINE_INT      0x03   /* Receive line status interrupt (Highest priority) */

#define U1IIR_IP                   0x01   /* Bit 0: IP (Interrupt pending) */
#define U1IIR_IP_INTERRUPT         0x00   /* Interrupt pending  */
#define U1IIR_IP_NO_INTERRUPT      0x01   /* No pending interrupt */


