neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define U1MSR_DDCD                 0x08   /* Bit 3: DDCD (Delta status change of DCD) */
#define U1MSR_DDCD_NO              0x00   /* No change */
#define U1MSR_DDCD_CHANGED         0x01   /* DCD changed */

#define U1MSR_TERI                 0x04   /* Bit 2: TERI (Trailing edge change of RI) */
#define U1MSR_TERI_NO              0x00   /* No change */
#define U1MSR_TERI_CHANGED         0x01   /* RI changed */

#define U1MSR_DDSR                 0x02   /* Bit 1: DDSR (Delta status change of DSR) */
#define U1MSR_DDSR_NO              0x00   /* No change */
#define U1MSR_DDSR_CHANGED         0x01   /* DSR changed */

#define U1MSR_DCTS                 0x01   /* Bit 0: DCTS (Delta status change of CTS) */
#define U1MSR_DCTS_NO              0x00   /* No change */
#define U1MSR_DCTS_CHANGED         0x01   /* CTS changed */


/*
**---------------------------------------------------------------------------
**  UART1 Scratch Pad Register
**---------------------------------------------------------------------------
*/

#define U1SCR_DATA                 0xff   /* Bit 7-0: DATA (A readable /writable byte) */


/*
**---------------------------------------------------------------------------
**  PWM Interrupt Register
**---------------------------------------------------------------------------
*/

#define PWMIR_MR6INT               0x400  /* Bit 10: MR6INT (Interrupt flag for PWM match channel 6) */
#define PWMIR_MR6INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR6INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR5INT               0x200  /* Bit 9: MR5INT (Interrupt flag for PWM match channel 5) */
#define PWMIR_MR5INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR5INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR4INT               0x100  /* Bit 8: MR4INT (Interrupt flag for PWM match channel 4) */
#define PWMIR_MR4INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR4INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR3INT               0x08   /* Bit 3: MR3INT (Interrupt flag for PWM match channel 3) */
#define PWMIR_MR3INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR3INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR2INT               0x04   /* Bit 2: MR2INT (Interrupt flag for PWM match channel 2) */
#define PWMIR_MR2INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR2INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR1INT               0x02   /* Bit 1: MR1INT (Interrupt flag for PWM match channel 1) */
#define PWMIR_MR1INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR1INT_INTERRUPT     0x01   /* Interrupt */

#define PWMIR_MR0INT               0x01   /* Bit 0: MR0INT (Interrupt flag for PWM match channel 0) */
#define PWMIR_MR0INT_NO_INTERRUPT  0x00   /* No interrupt */
#define PWMIR_MR0INT_INTERRUPT     0x01   /* Interrupt */


/*
**---------------------------------------------------------------------------
**  PWM Timer Control Register
**---------------------------------------------------------------------------
*/

#define PWMTCR_PWMEN               0x08   /* Bit 3: PWMEN (PWM enable) */
#define PWMTCR_PWMEN_DISABLED      0x00   /* Disabled */
#define PWMTCR_PWMEN_ENABLED       0x01   /* Enabled (Shadow registers operates) */

#define PWMTCR_CR                  0x02   /* Bit 1: CR (Counter reset) */
#define PWMTCR_CR_NO_RESET         0x00   /* No reset */
#define PWMTCR_CR_RESET            0x01   /* Generate reset */

#define PWMTCR_CE                  0x01   /* Bit 0: CE (Counter enable) */
#define PWMTCR_CE_DISABLED         0x00   /* Disabled */
#define PWMTCR_CE_ENABLED          0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  PWM Timer Counter
**---------------------------------------------------------------------------
*/

#define PWMTC_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM counter value) */


/*
**---------------------------------------------------------------------------
**  PWM Prescale Register
**---------------------------------------------------------------------------
*/

#define PWMPR_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM prescaler max value) */


/*
**---------------------------------------------------------------------------
**  PWM Prescale Counter
**---------------------------------------------------------------------------
*/

#define PWMPC_VALUE                0xffffffff /* Bit 31-0: VALUE (PWM prescale counter value) */


/*
**---------------------------------------------------------------------------
**  PWM Match Control Register
**---------------------------------------------------------------------------
*/

#define PWMMCR_MR6STOP             0x100000 /* Bit 20: MR6STOP (Stop on MR6) */
#define PWMMCR_MR6STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR6STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR6RES              0x80000 /* Bit 19: MR6RES (Reset on MR6) */
#define PWMMCR_MR6RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR6RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR6INT              0x40000 /* Bit 18: MR6INT (Interrupt on MR6) */
#define PWMMCR_MR6INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR6INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR5STOP             0x20000 /* Bit 17: MR5STOP (Stop on MR5) */
#define PWMMCR_MR5STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR5STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR5RES              0x10000 /* Bit 16: MR5RES (Reset on MR5) */
#define PWMMCR_MR5RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR5RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR5INT              0x8000 /* Bit 15: MR5INT (Interrupt on MR5) */
#define PWMMCR_MR5INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR5INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR4STOP             0x4000 /* Bit 14: MR4STOP (Stop on MR4) */
#define PWMMCR_MR4STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR4STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR4RES              0x2000 /* Bit 13: MR4RES (Reset on MR4) */
#define PWMMCR_MR4RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR4RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR4INT              0x1000 /* Bit 12: MR4INT (Interrupt on MR4) */
#define PWMMCR_MR4INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR4INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR3STOP             0x800  /* Bit 11: MR3STOP (Stop on MR3) */
#define PWMMCR_MR3STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR3STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR3RES              0x400  /* Bit 10: MR3RES (Reset on MR3) */
#define PWMMCR_MR3RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR3RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR3INT              0x200  /* Bit 9: MR3INT (Interrupt on MR3) */
#define PWMMCR_MR3INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR3INT_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR2STOP             0x100  /* Bit 8: MR2STOP (Stop on MR2) */
#define PWMMCR_MR2STOP_DISABLED    0x00   /* Disabled */
#define PWMMCR_MR2STOP_ENABLED     0x01   /* Enabled */

#define PWMMCR_MR2RES              0x80   /* Bit 7: MR2RES (Reset on MR2) */
#define PWMMCR_MR2RES_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR2RES_ENABLED      0x01   /* Enabled */

#define PWMMCR_MR2INT              0x40   /* Bit 6: MR2INT (Interrupt on MR2) */
#define PWMMCR_MR2INT_DISABLED     0x00   /* Disabled */
#define PWMMCR_MR2INT_ENABLED      0x01   /* Enabled */

