neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 0
**---------------------------------------------------------------------------
*/

#define CTIME0_DOW                 0x7000000 /* Bit 26-24: DOW (Day of week (0-6)) */

#define CTIME0_HOUR                0x1f0000 /* Bit 20-16: HOUR (Hour (0-23)) */

#define CTIME0_MIN                 0x3f00 /* Bit 13-8: MIN (Minute (0-59)) */

#define CTIME0_SEC                 0x3f   /* Bit 5-0: SEC (Second (0-59)) */


/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 1
**---------------------------------------------------------------------------
*/

#define CTIME1_YEAR                0xfff0000 /* Bit 27-16: YEAR (Year (0-4095)) */

#define CTIME1_MON                 0xf00  /* Bit 11-8: MON (Month (1-12)) */

#define CTIME1_DOM                 0x1f   /* Bit 4-0: DOM (Day of month (1-28,29,30,31)) */


/*
**---------------------------------------------------------------------------
**  Consolidated Time Register 2
**---------------------------------------------------------------------------
*/

#define CTIME2_DOY                 0xfff  /* Bit 11-0: DOY (Day of year (1-365,366)) */


/*
**---------------------------------------------------------------------------
**  Seconds Register
**---------------------------------------------------------------------------
*/

#define SEC_SEC                    0x3f   /* Bit 5-0: SEC (Seconds (0-59)) */


/*
**---------------------------------------------------------------------------
**  Minutes Register
**---------------------------------------------------------------------------
*/

#define MIN_MIN                    0x3f   /* Bit 5-0: MIN (Minutes (0-59)) */


/*
**---------------------------------------------------------------------------
**  Hours Register
**---------------------------------------------------------------------------
*/

#define HOUR_HOUR                  0x1f   /* Bit 4-0: HOUR (Hours (0-23)) */


/*
**---------------------------------------------------------------------------
**  Day of Month Register
**---------------------------------------------------------------------------
*/

#define DOM_DOM                    0x1f   /* Bit 4-0: DOM (Day of month (1-28, 29, 30, 31)) */


/*
**---------------------------------------------------------------------------
**  Day of Week Register
**---------------------------------------------------------------------------
*/

#define DOW_DOW                    0x07   /* Bit 2-0: DOW (Day of week (0-6)) */


/*
**---------------------------------------------------------------------------
**  Day of Year Register
**---------------------------------------------------------------------------
*/

#define DOY_DOY                    0x1ff  /* Bit 8-0: DOY (Day of year (1-365, 366)) */


/*
**---------------------------------------------------------------------------
**  Months Register
**---------------------------------------------------------------------------
*/

#define MONTH_MON                  0x0f   /* Bit 3-0: MON (Month (1-12)) */


/*
**---------------------------------------------------------------------------
**  Years Register
**---------------------------------------------------------------------------
*/

#define YEAR_YEAR                  0xfff  /* Bit 11-0: YEAR (Year (0-4095)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Seconds
**---------------------------------------------------------------------------
*/

#define ALSEC_SEC                  0x3f   /* Bit 5-0: SEC (Seconds (0-59)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Minutes
**---------------------------------------------------------------------------
*/

#define ALMIN_MIN                  0x3f   /* Bit 5-0: MIN (Minutes (0-59)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Hours
**---------------------------------------------------------------------------
*/

#define ALHOUR_HOUR                0x1f   /* Bit 4-0: HOUR (Hours (0-23)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Month
**---------------------------------------------------------------------------
*/

#define ALDOM_DOM                  0x1f   /* Bit 4-0: DOM (Day of month (1-28, 29, 30, 31)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Week
**---------------------------------------------------------------------------
*/

#define ALDOW_DOW                  0x07   /* Bit 2-0: DOW (Day of week (0-6)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Day of Year
**---------------------------------------------------------------------------
*/

#define ALDOY_DOY                  0x1ff  /* Bit 8-0: DOY (Day of year (1-365, 366)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Month
**---------------------------------------------------------------------------
*/

#define ALMON_MON                  0x0f   /* Bit 3-0: MON (Month (1-12)) */


/*
**---------------------------------------------------------------------------
**  Alarm value for Year
**---------------------------------------------------------------------------
*/

#define ALYEAR_YEAR                0xfff  /* Bit 11-0: YEAR (Year (0-4095)) */


/*
**---------------------------------------------------------------------------
**  Prescaler value, integer portion
**---------------------------------------------------------------------------
*/

#define PREINT_VALUE               0x1fff /* Bit 12-0: VALUE (Integer portion of RTC prescaler value) */


/*
**---------------------------------------------------------------------------
**  Prescaler value, fraction portion
**---------------------------------------------------------------------------
*/

#define PREFRAC_VALUE              0x7fff /* Bit 14-0: VALUE (Fractional portion of RTC prescaler value) */


