neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define IODIR_P0_23                0x800000 /* Bit 23: P0_23 (Port 0.23) */
#define IODIR_P0_23_INPUT          0x00   /* Input */
#define IODIR_P0_23_OUTPUT         0x01   /* Output */

#define IODIR_P0_22                0x400000 /* Bit 22: P0_22 (Port 0.22) */
#define IODIR_P0_22_INPUT          0x00   /* Input */
#define IODIR_P0_22_OUTPUT         0x01   /* Output */

#define IODIR_P0_21                0x200000 /* Bit 21: P0_21 (Port 0.21) */
#define IODIR_P0_21_INPUT          0x00   /* Input */
#define IODIR_P0_21_OUTPUT         0x01   /* Output */

#define IODIR_P0_20                0x100000 /* Bit 20: P0_20 (Port 0.20) */
#define IODIR_P0_20_INPUT          0x00   /* Input */
#define IODIR_P0_20_OUTPUT         0x01   /* Output */

#define IODIR_P0_19                0x80000 /* Bit 19: P0_19 (Port 0.19) */
#define IODIR_P0_19_INPUT          0x00   /* Input */
#define IODIR_P0_19_OUTPUT         0x01   /* Output */

#define IODIR_P0_18                0x40000 /* Bit 18: P0_18 (Port 0.18) */
#define IODIR_P0_18_INPUT          0x00   /* Input */
#define IODIR_P0_18_OUTPUT         0x01   /* Output */

#define IODIR_P0_17                0x20000 /* Bit 17: P0_17 (Port 0.17) */
#define IODIR_P0_17_INPUT          0x00   /* Input */
#define IODIR_P0_17_OUTPUT         0x01   /* Output */

#define IODIR_P0_16                0x10000 /* Bit 16: P0_16 (Port 0.16) */
#define IODIR_P0_16_INPUT          0x00   /* Input */
#define IODIR_P0_16_OUTPUT         0x01   /* Output */

#define IODIR_P0_15                0x8000 /* Bit 15: P0_15 (Port 0.15) */
#define IODIR_P0_15_INPUT          0x00   /* Input */
#define IODIR_P0_15_OUTPUT         0x01   /* Output */

#define IODIR_P0_14                0x4000 /* Bit 14: P0_14 (Port 0.14) */
#define IODIR_P0_14_INPUT          0x00   /* Input */
#define IODIR_P0_14_OUTPUT         0x01   /* Output */

#define IODIR_P0_13                0x2000 /* Bit 13: P0_13 (Port 0.13) */
#define IODIR_P0_13_INPUT          0x00   /* Input */
#define IODIR_P0_13_OUTPUT         0x01   /* Output */

#define IODIR_P0_12                0x1000 /* Bit 12: P0_12 (Port 0.12) */
#define IODIR_P0_12_INPUT          0x00   /* Input */
#define IODIR_P0_12_OUTPUT         0x01   /* Output */

#define IODIR_P0_11                0x800  /* Bit 11: P0_11 (Port 0.11) */
#define IODIR_P0_11_INPUT          0x00   /* Input */
#define IODIR_P0_11_OUTPUT         0x01   /* Output */

#define IODIR_P0_10                0x400  /* Bit 10: P0_10 (Port 0.10) */
#define IODIR_P0_10_INPUT          0x00   /* Input */
#define IODIR_P0_10_OUTPUT         0x01   /* Output */

#define IODIR_P0_9                 0x200  /* Bit 9: P0_9 (Port 0.9) */
#define IODIR_P0_9_INPUT           0x00   /* Input */
#define IODIR_P0_9_OUTPUT          0x01   /* Output */

#define IODIR_P0_8                 0x100  /* Bit 8: P0_8 (Port 0.8) */
#define IODIR_P0_8_INPUT           0x00   /* Input */
#define IODIR_P0_8_OUTPUT          0x01   /* Output */

#define IODIR_P0_7                 0x80   /* Bit 7: P0_7 (Port 0.7) */
#define IODIR_P0_7_INPUT           0x00   /* Input */
#define IODIR_P0_7_OUTPUT          0x01   /* Output */

#define IODIR_P0_6                 0x40   /* Bit 6: P0_6 (Port 0.6) */
#define IODIR_P0_6_INPUT           0x00   /* Input */
#define IODIR_P0_6_OUTPUT          0x01   /* Output */

#define IODIR_P0_5                 0x20   /* Bit 5: P0_5 (Port 0.5) */
#define IODIR_P0_5_INPUT           0x00   /* Input */
#define IODIR_P0_5_OUTPUT          0x01   /* Output */

#define IODIR_P0_4                 0x10   /* Bit 4: P0_4 (Port 0.4) */
#define IODIR_P0_4_INPUT           0x00   /* Input */
#define IODIR_P0_4_OUTPUT          0x01   /* Output */

#define IODIR_P0_3                 0x08   /* Bit 3: P0_3 (Port 0.3) */
#define IODIR_P0_3_INPUT           0x00   /* Input */
#define IODIR_P0_3_OUTPUT          0x01   /* Output */

#define IODIR_P0_2                 0x04   /* Bit 2: P0_2 (Port 0.2) */
#define IODIR_P0_2_INPUT           0x00   /* Input */
#define IODIR_P0_2_OUTPUT          0x01   /* Output */

#define IODIR_P0_1                 0x02   /* Bit 1: P0_1 (Port 0.1) */
#define IODIR_P0_1_INPUT           0x00   /* Input */
#define IODIR_P0_1_OUTPUT          0x01   /* Output */

#define IODIR_P0_0                 0x01   /* Bit 0: P0_0 (Port 0.0) */
#define IODIR_P0_0_INPUT           0x00   /* Input */
#define IODIR_P0_0_OUTPUT          0x01   /* Output */


/*
**---------------------------------------------------------------------------
**  GPIO output set register
**---------------------------------------------------------------------------
*/

#define IOCLR_P0_31                0x80000000 /* Bit 31: P0_31 (Port 0.31) */
#define IOCLR_P0_31_LOW            0x00   /* Low */
#define IOCLR_P0_31_HIGH           0x01   /* High */

#define IOCLR_P0_30                0x40000000 /* Bit 30: P0_30 (Port 0.30) */
#define IOCLR_P0_30_LOW            0x00   /* Low */
#define IOCLR_P0_30_HIGH           0x01   /* High */

#define IOCLR_P0_29                0x20000000 /* Bit 29: P0_29 (Port 0.29) */
#define IOCLR_P0_29_LOW            0x00   /* Low */
#define IOCLR_P0_29_HIGH           0x01   /* High */

#define IOCLR_P0_28                0x10000000 /* Bit 28: P0_28 (Port 0.28) */
#define IOCLR_P0_28_LOW            0x00   /* Low */
#define IOCLR_P0_28_HIGH           0x01   /* High */

#define IOCLR_P0_27                0x8000000 /* Bit 27: P0_27 (Port 0.27) */
#define IOCLR_P0_27_LOW            0x00   /* Low */
#define IOCLR_P0_27_HIGH           0x01   /* High */

#define IOCLR_P0_26                0x4000000 /* Bit 26: P0_26 (Port 0.26) */
#define IOCLR_P0_26_LOW            0x00   /* Low */
#define IOCLR_P0_26_HIGH           0x01   /* High */

#define IOCLR_P0_25                0x2000000 /* Bit 25: P0_25 (Port 0.25) */
#define IOCLR_P0_25_LOW            0x00   /* Low */
#define IOCLR_P0_25_HIGH           0x01   /* High */

#define IOCLR_P0_24                0x1000000 /* Bit 24: P0_24 (Port 0.24) */
#define IOCLR_P0_24_LOW            0x00   /* Low */
#define IOCLR_P0_24_HIGH           0x01   /* High */

#define IOCLR_P0_23                0x800000 /* Bit 23: P0_23 (Port 0.23) */
#define IOCLR_P0_23_LOW            0x00   /* Low */
#define IOCLR_P0_23_HIGH           0x01   /* High */

#define IOCLR_P0_22                0x400000 /* Bit 22: P0_22 (Port 0.22) */
#define IOCLR_P0_22_LOW            0x00   /* Low */
#define IOCLR_P0_22_HIGH           0x01   /* High */

#define IOCLR_P0_21                0x200000 /* Bit 21: P0_21 (Port 0.21) */
#define IOCLR_P0_21_LOW            0x00   /* Low */
#define IOCLR_P0_21_HIGH           0x01   /* High */

#define IOCLR_P0_20                0x100000 /* Bit 20: P0_20 (Port 0.20) */
#define IOCLR_P0_20_LOW            0x00   /* Low */
#define IOCLR_P0_20_HIGH           0x01   /* High */

#define IOCLR_P0_19                0x80000 /* Bit 19: P0_19 (Port 0.19) */
#define IOCLR_P0_19_LOW            0x00   /* Low */
#define IOCLR_P0_19_HIGH           0x01   /* High */

