neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define PINSEL0_P0_2               0x30   /* Bit 5-4: P0_2 (Port 0.2) */
#define PINSEL0_P0_2_PORT0_2       0x00   /* GPIO Port 0.2 */
#define PINSEL0_P0_2_SCL           0x01   /* SCL (I2C) */
#define PINSEL0_P0_2_CAP0_0        0x02   /* Capture 0.0 (Timer 0) */

#define PINSEL0_P0_1               0x0c   /* Bit 3-2: P0_1 (Port 0.1) */
#define PINSEL0_P0_1_PORT0_1       0x00   /* GPIO Port 0.1 */
#define PINSEL0_P0_1_RXD0          0x01   /* RxD0 (UART0) */
#define PINSEL0_P0_1_PWM3          0x02   /* PWM3 */

#define PINSEL0_P0_0               0x03   /* Bit 1-0: P0_0 (Port 0.0) */
#define PINSEL0_P0_0_PORT0_0       0x00   /* GPIO Port 0.0 */
#define PINSEL0_P0_0_TXD0          0x01   /* TxD0 (UART0) */
#define PINSEL0_P0_0_PWM1          0x02   /* PWM1 */


/*
**---------------------------------------------------------------------------
**  Pin Function Select Register 1
**---------------------------------------------------------------------------
*/

#define PINSEL1_P0_31              0xc0000000 /* Bit 31-30: P0_31 (Port 0.31) */
#define PINSEL1_P0_31_PORT0_31     0x00   /* GPIO Port 0.31 */
#define PINSEL1_P0_31_TDO          0x01   /* TDO (JTAG) */

#define PINSEL1_P0_30              0x30000000 /* Bit 29-28: P0_30 (Port 0.30) */
#define PINSEL1_P0_30_PORT0_30     0x00   /* GPIO Port 0.30 */
#define PINSEL1_P0_30_TDI          0x01   /* TDI (JTAG) */

#define PINSEL1_P0_29              0xc000000 /* Bit 27-26: P0_29 (Port 0.29) */
#define PINSEL1_P0_29_PORT0_29     0x00   /* GPIO Port 0.29 */
#define PINSEL1_P0_29_TCK          0x01   /* TCK (JTAG) */

#define PINSEL1_P0_28              0x3000000 /* Bit 25-24: P0_28 (Port 0.28) */
#define PINSEL1_P0_28_PORT0_28     0x00   /* GPIO Port 0.28 */
#define PINSEL1_P0_28_TMS          0x01   /* TMS (JTAG) */

#define PINSEL1_P0_27              0xc00000 /* Bit 23-22: P0_27 (Port 0.27) */
#define PINSEL1_P0_27_PORT0_27     0x00   /* GPIO Port 0.27 */
#define PINSEL1_P0_27_TRST         0x01   /* TRST (JTAG) */

#define PINSEL1_P0_26              0x300000 /* Bit 21-20: P0_26 (Port 0.26) */
#define PINSEL1_P0_26_PORT0_26     0x00   /* GPIO Port 0.26 */

#define PINSEL1_P0_25              0xc0000 /* Bit 19-18: P0_25 (Port 0.25) */
#define PINSEL1_P0_25_PORT0_25     0x00   /* GPIO Port 0.25 */

#define PINSEL1_P0_24              0x30000 /* Bit 17-16: P0_24 (Port 0.24) */
#define PINSEL1_P0_24_PORT0_24     0x00   /* GPIO Port 0.24 */

#define PINSEL1_P0_23              0xc000 /* Bit 15-14: P0_23 (Port 0.23) */
#define PINSEL1_P0_23_PORT0_23     0x00   /* GPIO Port 0.23 */

#define PINSEL1_P0_22              0x3000 /* Bit 13-12: P0_22 (Port 0.22) */
#define PINSEL1_P0_22_PORT0_22     0x00   /* GPIO Port 0.22 */

#define PINSEL1_P0_21              0xc00  /* Bit 11-10: P0_21 (Port 0.21) */
#define PINSEL1_P0_21_PORT0_21     0x00   /* GPIO Port 0.21 */
#define PINSEL1_P0_21_PWM5         0x01   /* PWM5 */

#define PINSEL1_P0_20              0x300  /* Bit 9-8: P0_20 (Port 0.20) */
#define PINSEL1_P0_20_PORT0_20     0x00   /* GPIO Port 0.20 */
#define PINSEL1_P0_20_MAT1_3       0x01   /* Match 1.3 (Timer 1) */

#define PINSEL1_P0_19              0xc0   /* Bit 7-6: P0_19 (Port 0.19) */
#define PINSEL1_P0_19_PORT0_19     0x00   /* GPIO Port 0.19 */
#define PINSEL1_P0_19_MAT1_2       0x01   /* Match 1.2 (Timer 1) */

#define PINSEL1_P0_18              0x30   /* Bit 5-4: P0_18 (Port 0.18) */
#define PINSEL1_P0_18_PORT0_18     0x00   /* GPIO Port 0.18 */
#define PINSEL1_P0_18_CAP1_3       0x01   /* Capture 1.3 (Timer 1) */

#define PINSEL1_P0_17              0x0c   /* Bit 3-2: P0_17 (Port 0.17) */
#define PINSEL1_P0_17_PORT0_17     0x00   /* GPIO Port 0.17 */
#define PINSEL1_P0_17_CAP1_2       0x01   /* Capture 1.2 (Timer 1) */

#define PINSEL1_P0_16              0x03   /* Bit 1-0: P0_16 (Port 0.16) */
#define PINSEL1_P0_16_PORT0_16     0x00   /* GPIO Port 0.16 */
#define PINSEL1_P0_16_EINT0        0x01   /* EINT0 (INTR) */
#define PINSEL1_P0_16_MAT0_2       0x02   /* Match 0.2 (Timer 0) */


/*
**---------------------------------------------------------------------------
**  MAM Control Register
**---------------------------------------------------------------------------
*/

#define MAMCR_MODECTRL             0x03   /* Bit 1-0: MODECTRL (MAM mode control) */
#define MAMCR_MODECTRL_DISABLED    0x00   /* MAM disabled */
#define MAMCR_MODECTRL_PARTIALLY   0x01   /* MAM partially enabled */
#define MAMCR_MODECTRL_ENABLED     0x02   /* MAM fully enabled */


/*
**---------------------------------------------------------------------------
**  MAM Timing Control Register
**---------------------------------------------------------------------------
*/

#define MAMTIM_CYCLES              0x07   /* Bit 2-0: CYCLES (MAM fetch cycle timing) */
#define MAMTIM_CYCLES_ONE          0x01   /* 1 processor clock */
#define MAMTIM_CYCLES_TWO          0x02   /* 2 processor clock */
#define MAMTIM_CYCLES_THREE        0x03   /* 3 processor clock */
#define MAMTIM_CYCLES_FOUR         0x04   /* 4 processor clock */
#define MAMTIM_CYCLES_FIVE         0x05   /* 5 processor clock */
#define MAMTIM_CYCLES_SIX          0x06   /* 6 processor clock */
#define MAMTIM_CYCLES_SEVEN        0x07   /* 7 processor clock */


/*
**---------------------------------------------------------------------------
**  Memory Mapping Control Register
**---------------------------------------------------------------------------
*/

#define MEMMAP_MAP                 0x03   /* Bit 1-0: MAP (Memory map control) */
#define MEMMAP_MAP_BOOT            0x00   /* Boot loader mode */
#define MEMMAP_MAP_FLASH           0x01   /* Flash mode */
#define MEMMAP_MAP_RAM             0x02   /* RAM mode */


/*
**---------------------------------------------------------------------------
**  PLL Control Register
**---------------------------------------------------------------------------
*/

#define PLLCON_PLLC                0x02   /* Bit 1: PLLC (PLL Connect) */
#define PLLCON_PLLC_DISCONNECTED   0x00   /* Disconnected */
#define PLLCON_PLLC_CONNECTED      0x01   /* Connected */

#define PLLCON_PLLE                0x01   /* Bit 0: PLLE (PLL Enabled) */
#define PLLCON_PLLE_DISABLED       0x00   /* Disabled */
#define PLLCON_PLLE_ENABLED        0x01   /* Enabled */


