neuberfran/uvga-conio-demo/lpc21xx_iar/ma_sfr.h
#define VICINTENABLE_INT3          0x08   /* Bit 3: INT3 (Interrupt 3) */
#define VICINTENABLE_INT3_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT3_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT2          0x04   /* Bit 2: INT2 (Interrupt 2) */
#define VICINTENABLE_INT2_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT2_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT1          0x02   /* Bit 1: INT1 (Interrupt 1) */
#define VICINTENABLE_INT1_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT1_ENABLED  0x01   /* Enabled */

#define VICINTENABLE_INT0          0x01   /* Bit 0: INT0 (Interrupt 0) */
#define VICINTENABLE_INT0_DISABLED  0x00  /* Disabled */
#define VICINTENABLE_INT0_ENABLED  0x01   /* Enabled */


/*
**---------------------------------------------------------------------------
**  Interrupt Enable Clear Register
**---------------------------------------------------------------------------
*/

#define VICINTENCLR_INT31          0x80000000 /* Bit 31: INT31 (Interrupt 31) */
#define VICINTENCLR_INT31_LOW      0x00   /* Low */
#define VICINTENCLR_INT31_HIGH     0x01   /* High */

#define VICINTENCLR_INT30          0x40000000 /* Bit 30: INT30 (Interrupt 30) */
#define VICINTENCLR_INT30_LOW      0x00   /* Low */
#define VICINTENCLR_INT30_HIGH     0x01   /* High */

#define VICINTENCLR_INT29          0x20000000 /* Bit 29: INT29 (Interrupt 29) */
#define VICINTENCLR_INT29_LOW      0x00   /* Low */
#define VICINTENCLR_INT29_HIGH     0x01   /* High */

#define VICINTENCLR_INT28          0x10000000 /* Bit 28: INT28 (Interrupt 28) */
#define VICINTENCLR_INT28_LOW      0x00   /* Low */
#define VICINTENCLR_INT28_HIGH     0x01   /* High */

#define VICINTENCLR_INT27          0x8000000 /* Bit 27: INT27 (Interrupt 27) */
#define VICINTENCLR_INT27_LOW      0x00   /* Low */
#define VICINTENCLR_INT27_HIGH     0x01   /* High */

#define VICINTENCLR_INT26          0x4000000 /* Bit 26: INT26 (Interrupt 26) */
#define VICINTENCLR_INT26_LOW      0x00   /* Low */
#define VICINTENCLR_INT26_HIGH     0x01   /* High */

#define VICINTENCLR_INT25          0x2000000 /* Bit 25: INT25 (Interrupt 25) */
#define VICINTENCLR_INT25_LOW      0x00   /* Low */
#define VICINTENCLR_INT25_HIGH     0x01   /* High */

#define VICINTENCLR_INT24          0x1000000 /* Bit 24: INT24 (Interrupt 24) */
#define VICINTENCLR_INT24_LOW      0x00   /* Low */
#define VICINTENCLR_INT24_HIGH     0x01   /* High */

#define VICINTENCLR_INT23          0x800000 /* Bit 23: INT23 (Interrupt 23) */
#define VICINTENCLR_INT23_LOW      0x00   /* Low */
#define VICINTENCLR_INT23_HIGH     0x01   /* High */

#define VICINTENCLR_INT22          0x400000 /* Bit 22: INT22 (Interrupt 22) */
#define VICINTENCLR_INT22_LOW      0x00   /* Low */
#define VICINTENCLR_INT22_HIGH     0x01   /* High */

#define VICINTENCLR_INT21          0x200000 /* Bit 21: INT21 (Interrupt 21) */
#define VICINTENCLR_INT21_LOW      0x00   /* Low */
#define VICINTENCLR_INT21_HIGH     0x01   /* High */

#define VICINTENCLR_INT20          0x100000 /* Bit 20: INT20 (Interrupt 20) */
#define VICINTENCLR_INT20_LOW      0x00   /* Low */
#define VICINTENCLR_INT20_HIGH     0x01   /* High */

#define VICINTENCLR_INT19          0x80000 /* Bit 19: INT19 (Interrupt 19) */
#define VICINTENCLR_INT19_LOW      0x00   /* Low */
#define VICINTENCLR_INT19_HIGH     0x01   /* High */

#define VICINTENCLR_INT18          0x40000 /* Bit 18: INT18 (Interrupt 18) */
#define VICINTENCLR_INT18_LOW      0x00   /* Low */
#define VICINTENCLR_INT18_HIGH     0x01   /* High */

#define VICINTENCLR_INT17          0x20000 /* Bit 17: INT17 (Interrupt 17) */
#define VICINTENCLR_INT17_LOW      0x00   /* Low */
#define VICINTENCLR_INT17_HIGH     0x01   /* High */

#define VICINTENCLR_INT16          0x10000 /* Bit 16: INT16 (Interrupt 16) */
#define VICINTENCLR_INT16_LOW      0x00   /* Low */
#define VICINTENCLR_INT16_HIGH     0x01   /* High */

#define VICINTENCLR_INT15          0x8000 /* Bit 15: INT15 (Interrupt 15) */
#define VICINTENCLR_INT15_LOW      0x00   /* Low */
#define VICINTENCLR_INT15_HIGH     0x01   /* High */

#define VICINTENCLR_INT14          0x4000 /* Bit 14: INT14 (Interrupt 14) */
#define VICINTENCLR_INT14_LOW      0x00   /* Low */
#define VICINTENCLR_INT14_HIGH     0x01   /* High */

#define VICINTENCLR_INT13          0x2000 /* Bit 13: INT13 (Interrupt 13) */
#define VICINTENCLR_INT13_LOW      0x00   /* Low */
#define VICINTENCLR_INT13_HIGH     0x01   /* High */

#define VICINTENCLR_INT12          0x1000 /* Bit 12: INT12 (Interrupt 12) */
#define VICINTENCLR_INT12_LOW      0x00   /* Low */
#define VICINTENCLR_INT12_HIGH     0x01   /* High */

#define VICINTENCLR_INT11          0x800  /* Bit 11: INT11 (Interrupt 11) */
#define VICINTENCLR_INT11_LOW      0x00   /* Low */
#define VICINTENCLR_INT11_HIGH     0x01   /* High */

#define VICINTENCLR_INT10          0x400  /* Bit 10: INT10 (Interrupt 10) */
#define VICINTENCLR_INT10_LOW      0x00   /* Low */
#define VICINTENCLR_INT10_HIGH     0x01   /* High */

#define VICINTENCLR_INT9           0x200  /* Bit 9: INT9 (Interrupt 9) */
#define VICINTENCLR_INT9_LOW       0x00   /* Low */
#define VICINTENCLR_INT9_HIGH      0x01   /* High */

#define VICINTENCLR_INT8           0x100  /* Bit 8: INT8 (Interrupt 8) */
#define VICINTENCLR_INT8_LOW       0x00   /* Low */
#define VICINTENCLR_INT8_HIGH      0x01   /* High */

#define VICINTENCLR_INT7           0x80   /* Bit 7: INT7 (Interrupt 7) */
#define VICINTENCLR_INT7_LOW       0x00   /* Low */
#define VICINTENCLR_INT7_HIGH      0x01   /* High */

#define VICINTENCLR_INT6           0x40   /* Bit 6: INT6 (Interrupt 6) */
#define VICINTENCLR_INT6_LOW       0x00   /* Low */
#define VICINTENCLR_INT6_HIGH      0x01   /* High */

#define VICINTENCLR_INT5           0x20   /* Bit 5: INT5 (Interrupt 5) */
#define VICINTENCLR_INT5_LOW       0x00   /* Low */
#define VICINTENCLR_INT5_HIGH      0x01   /* High */

#define VICINTENCLR_INT4           0x10   /* Bit 4: INT4 (Interrupt 4) */
#define VICINTENCLR_INT4_LOW       0x00   /* Low */
#define VICINTENCLR_INT4_HIGH      0x01   /* High */

#define VICINTENCLR_INT3           0x08   /* Bit 3: INT3 (Interrupt 3) */
#define VICINTENCLR_INT3_LOW       0x00   /* Low */
#define VICINTENCLR_INT3_HIGH      0x01   /* High */

#define VICINTENCLR_INT2           0x04   /* Bit 2: INT2 (Interrupt 2) */
#define VICINTENCLR_INT2_LOW       0x00   /* Low */
#define VICINTENCLR_INT2_HIGH      0x01   /* High */

#define VICINTENCLR_INT1           0x02   /* Bit 1: INT1 (Interrupt 1) */
#define VICINTENCLR_INT1_LOW       0x00   /* Low */
#define VICINTENCLR_INT1_HIGH      0x01   /* High */

#define VICINTENCLR_INT0           0x01   /* Bit 0: INT0 (Interrupt 0) */
#define VICINTENCLR_INT0_LOW       0x00   /* Low */
#define VICINTENCLR_INT0_HIGH      0x01   /* High */


